# <h1 style="color:#e6004c;"> import data and packages </h1>

In [58]:
import pandas as pd
import numpy as np
import seaborn as sns

In [130]:
#sns.get_dataset_names()

In [67]:
titanic=sns.load_dataset('titanic')

## EDA

In [81]:
titanic.info() #overview of data types and missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [70]:
titanic.describe() #summary statistics on countinuous variables

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [75]:
#select the above continuous variables to a new df:  titanic_num
titanic.describe().columns

Index(['survived', 'pclass', 'age', 'sibsp', 'parch', 'fare'], dtype='object')

In [80]:
titanic_num=titanic.loc[:,titanic.describe().columns] #a new df with only numeric columns

In [72]:
titanic.sex.value_counts() #examine the categorical variables

male      577
female    314
Name: sex, dtype: int64

### missing values

In [73]:
sum(titanic.deck.isna()) #count the number of missing values

688

#### drop missing values (rows or columns)

In [ ]:
df.dropna() # drop rows with any missing values
df.dropna(axis='columns') # drop columns with any missing values
df.dropna(thresh=2) #keep rows that has at least two non-missing values. 
#Or use np.infinite
df=df[np.infinite(df[x])]

#### impute missing values

In [85]:
#impute missing for age (mean, medium)?

#titanic_num.apply(lambda x:max(x)-min(x))
titanic_num.apply(lambda x:x.mean()-x.median()) #since mean and median are not that different, let's just use mean for imputation.

survived     0.383838
pclass      -0.691358
age          1.699118
sibsp        0.523008
parch        0.381594
fare        17.750008
dtype: float64

In [86]:
#impute missing cells of age
titanic.age=titanic.age.fillna(titanic.age.mean())

In [87]:
#now lets see if all missing values are gone
sum(titanic.age.isna()) #Done!

0

# <h1 style="color:#1ac6ff;"> Slicing </h1>

### iloc and loc

In [93]:
#Four ways of selecting columns
titanic.iloc[:, 2], titanic.sex, titanic['sex'], titanic.loc[:,'sex']

In [ ]:
#selecting multiple columns
titanic.loc[:,('sex','age')] #pass a tuple inside 
titanic[['sex','age']] #pass a list inside

In [96]:
#filter rows using conditions 
titanic.loc[titanic['age']>titanic['age'].mean(), :] #selecting only rows that have above mean age

507

# <h1 style="color:#00b386;"> Groupby </h1>

In [102]:
titanic.groupby('sex').survived.mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [110]:
#what is the maximum age of passengers of each class?

In [109]:
titanic.groupby('class').age.max()

class
First     0.92
Second    0.67
Third     0.42
Name: age, dtype: float64

In [119]:
# Using agg to return more than one results
#the advantage is that it returns a df, that can be used for visualization or further transformations. 
titanic.groupby('class')['pclass', 'age'].agg(['max','min','mean'])
#k=titanic.groupby('class')['pclass', 'age'].agg(['max','min','mean'])

       pclass            age
          max min mean   max   min       mean
class
First       1   1    1  80.0  0.92  37.048118
Second      2   2    2  70.0  0.67  29.866958
Third       3   3    3  74.0  0.42  26.403259

# <h1 style="color:#e69900;"> Indexing </h1>

In [120]:
k.info()

<class 'pandas.core.frame.DataFrame'>
CategoricalIndex: 3 entries, First to Third
Data columns (total 6 columns):
(pclass, max)     3 non-null int64
(pclass, min)     3 non-null int64
(pclass, mean)    3 non-null int64
(age, max)        3 non-null float64
(age, min)        3 non-null float64
(age, mean)       3 non-null float64
dtypes: float64(3), int64(3)
memory usage: 251.0 bytes

In [116]:
k.index

CategoricalIndex(['First', 'Second', 'Third'], categories=['First', 'Second', 'Third'], ordered=False, name='class', dtype='category')

In [123]:
#indexing and slicing go well together
k.loc['Second']

pclass  max      2.000000
        min      2.000000
        mean     2.000000
age     max     70.000000
        min      0.670000
        mean    29.866958
Name: Second, dtype: float64

In [124]:
k.loc['Second']['age']

max     70.000000
min      0.670000
mean    29.866958
Name: Second, dtype: float64

In [127]:
# What's the average age of passengers in Third class? Which one is correct?
k.loc['Third']['age'].mean(), k.loc['Third']['age']['mean']

(33.607752885268155, 26.403258655804464)

In [129]:
k.loc['Third']['age']

max     74.000000
min      0.420000
mean    26.403259
Name: Third, dtype: float64